Zwalker-max/STM32_FPGA_2027_M29/Software/空例程/STM_FPGA_DDS_AD9959_AD9740_AD9220(底板2)/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_CS_Pin GPIO_PIN_3
#define LCD_CS_GPIO_Port GPIOE
#define LCD_DC_Pin GPIO_PIN_4
#define LCD_DC_GPIO_Port GPIOE
#define LCD_RST_Pin GPIO_PIN_5
#define LCD_RST_GPIO_Port GPIOE
#define AD9959_UPD_Pin GPIO_PIN_6
#define AD9959_UPD_GPIO_Port GPIOA
#define AD9959_SCL_Pin GPIO_PIN_7
#define AD9959_SCL_GPIO_Port GPIOA
#define AD9959_RST_Pin GPIO_PIN_4
#define AD9959_RST_GPIO_Port GPIOC
#define AD9959_CS_Pin GPIO_PIN_5
#define AD9959_CS_GPIO_Port GPIOC
#define AD9959_SDA_Pin GPIO_PIN_0
#define AD9959_SDA_GPIO_Port GPIOB
#define KEY_S2_Pin GPIO_PIN_15
#define KEY_S2_GPIO_Port GPIOG
#define KEY_S3_Pin GPIO_PIN_3
#define KEY_S3_GPIO_Port GPIOB
#define KEY_S1_Pin GPIO_PIN_4
#define KEY_S1_GPIO_Port GPIOB
#define KEY_S4_Pin GPIO_PIN_5
#define KEY_S4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
